soap/miniupnp/miniupnpd-2.1-igd2/seeds/30_WANIPC-GetListOfPortMappings_1

<?xml version="1.0" encoding="UTF-8"?><s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" ><s:Body><u:GetListOfPortMappings xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:2"><NewStartPort>41511</NewStartPort><NewEndPort>61356</NewEndPort><NewProtocol>TCP</NewProtocol><NewManage>1</NewManage><NewNumberOfPorts>30186</NewNumberOfPorts></u:GetListOfPortMappings></s:Body></s:Envelope>
